Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD20_DFP/3.2.41/samd20b/include/component/gclk.h
/* -------- GCLK_GENDIV : (GCLK Offset: 0x08) (R/W 32) Generic Clock Generator Division -------- */
#define GCLK_GENDIV_RESETVALUE                _U_(0x00)                                            /**<  (GCLK_GENDIV) Generic Clock Generator Division  Reset Value */

#define GCLK_GENDIV_ID_Pos                    _U_(0)                                               /**< (GCLK_GENDIV) Generic Clock Generator Selection Position */
#define GCLK_GENDIV_ID_Msk                    (_U_(0xF) << GCLK_GENDIV_ID_Pos)                     /**< (GCLK_GENDIV) Generic Clock Generator Selection Mask */
#define GCLK_GENDIV_ID(value)                 (GCLK_GENDIV_ID_Msk & ((value) << GCLK_GENDIV_ID_Pos))
#define   GCLK_GENDIV_ID_GCLK0_Val            _U_(0x0)                                             /**< (GCLK_GENDIV) Generic clock generator 0  */
#define   GCLK_GENDIV_ID_GCLK1_Val            _U_(0x1)                                             /**< (GCLK_GENDIV) Generic clock generator 1  */
#define   GCLK_GENDIV_ID_GCLK2_Val            _U_(0x2)                                             /**< (GCLK_GENDIV) Generic clock generator 2  */
#define   GCLK_GENDIV_ID_GCLK3_Val            _U_(0x3)                                             /**< (GCLK_GENDIV) Generic clock generator 3  */
#define   GCLK_GENDIV_ID_GCLK4_Val            _U_(0x4)                                             /**< (GCLK_GENDIV) Generic clock generator 4  */
#define   GCLK_GENDIV_ID_GCLK5_Val            _U_(0x5)                                             /**< (GCLK_GENDIV) Generic clock generator 5  */
#define   GCLK_GENDIV_ID_GCLK6_Val            _U_(0x6)                                             /**< (GCLK_GENDIV) Generic clock generator 6  */
#define   GCLK_GENDIV_ID_GCLK7_Val            _U_(0x7)                                             /**< (GCLK_GENDIV) Generic clock generator 7  */
#define GCLK_GENDIV_ID_GCLK0                  (GCLK_GENDIV_ID_GCLK0_Val << GCLK_GENDIV_ID_Pos)     /**< (GCLK_GENDIV) Generic clock generator 0 Position  */
#define GCLK_GENDIV_ID_GCLK1                  (GCLK_GENDIV_ID_GCLK1_Val << GCLK_GENDIV_ID_Pos)     /**< (GCLK_GENDIV) Generic clock generator 1 Position  */
#define GCLK_GENDIV_ID_GCLK2                  (GCLK_GENDIV_ID_GCLK2_Val << GCLK_GENDIV_ID_Pos)     /**< (GCLK_GENDIV) Generic clock generator 2 Position  */
#define GCLK_GENDIV_ID_GCLK3                  (GCLK_GENDIV_ID_GCLK3_Val << GCLK_GENDIV_ID_Pos)     /**< (GCLK_GENDIV) Generic clock generator 3 Position  */
#define GCLK_GENDIV_ID_GCLK4                  (GCLK_GENDIV_ID_GCLK4_Val << GCLK_GENDIV_ID_Pos)     /**< (GCLK_GENDIV) Generic clock generator 4 Position  */
#define GCLK_GENDIV_ID_GCLK5                  (GCLK_GENDIV_ID_GCLK5_Val << GCLK_GENDIV_ID_Pos)     /**< (GCLK_GENDIV) Generic clock generator 5 Position  */
#define GCLK_GENDIV_ID_GCLK6                  (GCLK_GENDIV_ID_GCLK6_Val << GCLK_GENDIV_ID_Pos)     /**< (GCLK_GENDIV) Generic clock generator 6 Position  */
#define GCLK_GENDIV_ID_GCLK7                  (GCLK_GENDIV_ID_GCLK7_Val << GCLK_GENDIV_ID_Pos)     /**< (GCLK_GENDIV) Generic clock generator 7 Position  */
#define GCLK_GENDIV_DIV_Pos                   _U_(8)                                               /**< (GCLK_GENDIV) Division Factor Position */
#define GCLK_GENDIV_DIV_Msk                   (_U_(0xFFFF) << GCLK_GENDIV_DIV_Pos)                 /**< (GCLK_GENDIV) Division Factor Mask */
#define GCLK_GENDIV_DIV(value)                (GCLK_GENDIV_DIV_Msk & ((value) << GCLK_GENDIV_DIV_Pos))
#define GCLK_GENDIV_Msk                       _U_(0x00FFFF0F)                                      /**< (GCLK_GENDIV) Register Mask  */


/** \brief GCLK register offsets definitions */
#define GCLK_CTRL_REG_OFST             (0x00)              /**< (GCLK_CTRL) Control Offset */
#define GCLK_STATUS_REG_OFST           (0x01)              /**< (GCLK_STATUS) Status Offset */
#define GCLK_CLKCTRL_REG_OFST          (0x02)              /**< (GCLK_CLKCTRL) Generic Clock Control Offset */
#define GCLK_GENCTRL_REG_OFST          (0x04)              /**< (GCLK_GENCTRL) Generic Clock Generator Control Offset */
#define GCLK_GENDIV_REG_OFST           (0x08)              /**< (GCLK_GENDIV) Generic Clock Generator Division Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief GCLK register API structure */
typedef struct
{  /* Generic Clock Generator */
  __IO  uint8_t                        GCLK_CTRL;          /**< Offset: 0x00 (R/W  8) Control */
  __I   uint8_t                        GCLK_STATUS;        /**< Offset: 0x01 (R/   8) Status */
  __IO  uint16_t                       GCLK_CLKCTRL;       /**< Offset: 0x02 (R/W  16) Generic Clock Control */
  __IO  uint32_t                       GCLK_GENCTRL;       /**< Offset: 0x04 (R/W  32) Generic Clock Generator Control */
  __IO  uint32_t                       GCLK_GENDIV;        /**< Offset: 0x08 (R/W  32) Generic Clock Generator Division */
} gclk_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMD20_GCLK_COMPONENT_H_ */
